## Задание 0 (Task 00)

1. Скопировать мой код HelloWorld в файл Program.java
2. Запустить из командной строки и проверить работоспособность

## Задание 1 (Task 01)

Представим, что есть банкомат. Он умеет выдавать деньги. Пришел человек, хочет снять определенную сумму.

```
int sum = 15867;
```

Необходимо вывести на экран, сколько купюр каждого достоинства он получит:

```
5000 - 3
2000 - 0
1000 - 0
500 - 1
и т.д.
```

```
System.out.println("5000 - " + x);
```

## Задание 2

Пусть есть число в диапазоне 0 ... 255

```
int number = 137;
```

Необходимо вывести в двоичном представлении.


### В задании 1 и 2 не разршается использовать циклы, массивы и т.д. чего я не давал (=

## Задание 3

Пусть есть последовательность (a1...aN), N->infinity, aN = -1

Необходимо посчитать произведение входных позиций чисел, у которых сумма цифр - простое число.

## Задание 4

На вход вразброс подаются числа от 1 до 1000. Одно число пропустили. Какое?

---

Объявить массив с явной инициализацей и решить следующие задачи:

## Задание 5

Вывести минимальный и максимальный элементы массива.

## Задание 6

Развернуть массив:

```
3 4 5 6 7 -> 7 6 5 4 3
```

## Задание 7

Найти количество локальных максимумов в массиве

```
a0, a1, ... aN-1 размера N

Локальный максимум: a[i-1] < a[i] > a[i+1], для i = 1, ... N - 2
```

## Задание 8

Реализовать сортировку выбором.

## Задание 9

Считать число с клавиатуры как массив символов -> этот массив символов нужно преобразовать в int-число.

```
-> 3467
{'3', '4', '6', '7'}
int x == 3467
```

## Задание 10

Считать две строки. Реализовать алгоритм, который ищет первое вхождение второй строки в первую

Писать самим.

1-я строка: Привет, как дела, как семья??
2-я строка: как дела
Результат: 8

## Задание 11

В отсортированном массиве, считанным с клавиатуры реализовать алгоритм бинарного поиска.


## Задание 12

Оптимизировать алгоритм вычисления чисел Фибоначчи, так, чтобы не было повторных рекурсивных вызовов (при этом рекурсию сохранить).

## Задание 13

* Переложить задание 2 на функцию.

## Задание ПЕРЕДЕЛАТЬ

* Задания 5 - 11 переделать на функции и процедуры

## Задание 14

* Реализовать программу, вычисляющую определенный интеграл x^2 на заданном отрезке с заданным количеством разбиений несколькими методами.

* [Метод прямоугольников](https://ru.wikipedia.org/wiki/Метод_прямоугольников) - Составные квадратурные формулы

* [Метод Симпсона](https://ru.wikipedia.org/wiki/Формула_Симпсона) - Составная формула (формула Котеса)

* [Метод Трапеций](https://ru.wikipedia.org/wiki/Метод_трапеций) - Составная формула

* [Wolfram Alpha](https://www.wolframalpha.com/input/?i=integral+of+x%5E2+from+0+to+1)

```
class Program {
	public static double f(double x) {
		return x * x;
	}

	public static double integralByRectangles(double a, double b, int n) {

	}

	public static double integralBySimpson(double a, double b, int n) {

	}

	public static double integralByTrapeze(double a, double b, int n) {

	}


	public static void main(String args[]) {
		Scanner scanner = new Scanner(System.in);
		double a = scanner.nextDouble();
		double b = scanner.nextDouble();
		int n = scanner.nextInt();
		System.out.println(integralByRectangles(a, b, n));
		System.out.println(integralBySimpson(a, b, n));
		System.out.println(integralByTrapeze(a, b, n));
	}
}
```

## Задание 15

Представим, что есть массив:

```
[-3] [4] [] [] [] []

Его размер - 6
Количество элементов - 2
```

* Реализовать процедуры:

- вставить в массив заданное число в конец.

```
-> 5 в конец
[-3] [4] [5] [] [] []

Его размер - 6
Количество элементов - 3
```

- вставить в массив заданное число в начало.

```
-> 1 в начало
[1] [-3] [4] [5] [] []

Его размер - 6
Количество элементов - 4
```

- удалить число из массива по индексу

```
-> удалить второе число
[1] [-3] [5] [] [] []

Его размер - 6
Количество элементов - 3
```

- вставить в массив заданное число в заданную позицию

```
-> 7 в позицию 3
[1] [-3] [4] [7] [5] []

Его размер - 6
Количество элементов - 5
```